Repository: varehus/q-agent
Catalog: po/*.po
Languages: de

source: could not duplicate file descriptor
de: konnte Dateideskriptor nicht duplizieren

source: error closing temporary file descriptor
de: Fehler beim Schließen eines temporären Dateideskriptors

source: could not assemble socket path
de: konnte den Pfad für die Buchse nicht zusammenbasteln

source: could not create socket directory
de: konnte Verzeichnis für die Buchse nicht anlegen

source: giving up after %d tries
de: nach %d Versuchen gebe ich jetzt auf

source: could not create socket
de: konnte Buchse nicht anlegen

source: could not assemble socket name
de: konnte Name der Buchse nicht zusammenbasteln

source: could not bind socket
de: konnte Buchse nicht an den Namen binden

source: could not listen to socket
de: konnte nicht an der Buchse lauschen

source: error while closing socket
de: Fehler beim Schließen der Buchse

source: could not unlink socket
de: konnte Buchse nicht entfernen

source: could not remove socket directory
de: konnte Verzeichnis für die Buchse nicht entfernen

source: could not allocate space in secure storage
de: konnte keinen Platz im sicheren Speicher reservieren

source: error while replying
de: Fehler beim Antworten

source: %s %s -e 'Enter secret to store under "%s":'
de: %s %s -e 'Geheimnis namens "%s" eingeben:'

source: Hand out secret %s%s%s%s?
de: Geheimnis %s%s%s%s herausgeben?

source: could not exec insure command
de: konnte Versicherungs-Kommando nicht ausführen

source: could not fork
de: konnte nicht gabeln

source: call of insure command failed
de: Aufruf des Versicherungs-Kommando schlug fehl

source: could not install %s handler: %s
de: konnte %s-Behandlung nicht installieren: %s

source: error in select
de: Fehler beim Warten auf Anfragen

source: could not accept connection
de: konnte keine Verbindung annehmen

source: error while receiving
de: Fehler beim Empfang

source: malformed message ignored
de: verstümmelte Nachricht ignoriert

source: request with wrong magic number - maybe an old client?
de: Nachricht mit alter Zauberzahl ignoriert - vielleicht ein alter client?

source: Warning: not forking is the default now, and --nofork has been deprecated
de: Warnung: die Voreinstellung ist nun nicht zu gabeln, deshalb ist »--nofork« nicht mehr zu verwenden

source: Usage: q-agent [OPTION]... -c, --csh emit commands compatible with c-shells -q, --query-options OPT pass options OPT through to the query program -d, --debug turn on debugging output --fork fork into the background - keep in mind that this will cause the agent to run until explicitly killed --help display this help and exit --version output version information and exit
de: Benutzung: q-agent [OPTION]... -c, --csh c-shell-kompatible Kommandos ausstossen -q, --query-options OPT Optionen OPT an das Abfrage-Programm übergeben -d, --debug schalte englische debugging-Meldungen ein --fork gable in den Hintergrund - es ist zu beachten, daß damit der agent bis zu seiner expliziten Terminierung laufen bleiben wird --help zeige diese Hilfe an and beende --version gib Versionsinformationen aus und beende

source: could not start new session
de: konnte keine neue Sitzung starten

source: could not open /dev/null
de: konnte /dev/null nicht öffnen

source: AGENT_SOCKET is not set
de: AGENT_SOCKET ist nicht gesetzt

source: could not connect to server
de: konnte keine Verbindung aufnehmen

source: wrong magic number on reply - maybe your agent is old?
de: falsche Zauberzahl in der Rückmeldung - vielleicht ein alter agent?

source: error receiving reply
de: Fehler beim Empfang

source: could not send request
de: konnte Anfrage nicht abschicken

source: out of memory
de: zuwenig freier Speicher

source: could not exec %s: %s
de: konnte %s nicht starten: %s

source: could not determine key id
de: konnte Schlüssel-id nicht bestimmen

source: agpg running inside itself, do you perhaps have gpg point to agpg? Bailing out ...
de: agpg läuft als sein eigener Subprozeß -- zeigt gpg vielleicht auf agpg? Ich gebe auf ...

source: could not set $AGPG_RUNNING
de: konnte $AGPG_RUNNING nicht setzen

source: could not create pipe
de: konnte Rohr nicht verlegen

source: error while writing passphrase
de: Fehler beim Schreiben der Passphrase

source: agent could not provide passphrase
de: Agent konnte die Passphrase nicht bereitstellen

source: could not finish writing passphrase
de: konnte Passphrase nicht fertigschreiben

source: could not wait for child
de: konnte nicht auf mein Kind warten

source: could not exec %s: %s
de: konnte %s nicht starten: %s

source: could not fork off %s: %s
de: konnte %s nicht gabeln: %s

source: Usage: q-client [OPTION]... put ID [COMMENT] q-client [OPTION]... {get|delete} ID q-client [OPTION]... list `put' reads a secret from stdin and stores it with the agent under ID with COMMENT, if specified, attached to it. `get' fetches the secret under ID, and prints it to stdout. `delete' induces the agent to forget the secret under ID. `list' lists the ids of all known secrets along with their comments. Options relevant to `put': -i, --insure ask again, before giving out a secret -q, --query-options OPT pass options OPT through to the query program -t, --time-to-live N forget the secret after N seconds General options: -d, --debug turn on debugging output --help display this help and exit --version output version information and exit
de: Benutzung: q-client [OPTION]... put ID [KOMMENTAR] q-client [OPTION]... {get|delete} ID q-client [OPTION]... list »put« liest ein Geheinmis von stdin und speichert es unter ID ab; das KOMMENTAR, falls angegeben, wird mitgespeichert. »get« holt das mit ID bezeichnete Geheimnis und druckt es auf stdout. »delete« zwingt den agent zum Vergessen des mit ID bezeichneten Geheimnisses. »list« listet die IDs aller aufbewahrten Geheimnisse und deren Kommentare auf. Optionen zu »put«: -i, --insure nachfragen vor der Ausgabe dieses Geheimnisses -q, --query-options OPT Optionen OPT an das Abfrageprogramm weitergeben -t, --time-to-live N Geheimnis nach N Sekunden vergessen Generische Optionen: -d, --debug schaltet englische debugging-Meldungen ein --help zeige diese Hilfe an und beende --version gib Versionsinformationen aus und beende

source: could not get terminal characteristics
de: konnte Terminalcharakteristik nicht auslesen

source: could not turn echoing off
de: konnte Zeichenausgabe nicht abdrehen

source: out of memory
de: zuwenig freier Speicher

source: error while reading
de: Fehler beim Lesen

source: could not turn echoing back on
de: konnte Zeichenausgabe nicht wieder aufdrehen

source: you must specify a command
de: ein Kommando muß angegeben werden

source: command must be one of: put, get, delete, list
de: Eines der Kommandos »put«, »get«, »delete«, »list« muß angegeben werden.

source: %s option has no meaning with %s command - ignored
de: Option %s hat keine Bedeutung zusammen mit dem %s Kommando - ignoriert

source: list wants no arguments
de: list will kein Argument

source: none
de: keine

source: put wants one or two arguments
de: put braucht ein oder zwei Argumente

source: Enter secret to store under "%s":
de: Geheimnis namens "%s" eingeben:

source: %s: invalid time-to-live
de: %s: Ungültige Lebensdauer

source: get wants exactly one argument
de: get braucht genau ein Argument

source: secret available, but I won't print it on a tty
de: Geheimnis verfügbar, werde es aber nicht direkt ausdrucken.

source: delete wants exactly one argument
de: delete braucht genau ein Argument

source: %s: option `%s' is ambiguous
de: %s: Die Option »%s« ist nicht eindeutig

source: %s: option `--%s' doesn't allow an argument
de: %s: Die Option »--%s« erlaubt kein Argument

source: %s: option `%c%s' doesn't allow an argument
de: %s: Die Option »%c%s« erlaubt kein Argument

source: %s: option `%s' requires an argument
de: %s: Die Option »%s« erfordert ein Argument

source: %s: unrecognized option `--%s'
de: %s: Unbekannte Option »--%s«

source: %s: unrecognized option `%c%s'
de: %s: Unbekannte Option »%c%s«

source: %s: illegal option -- %c
de: %s: Die Option ist nicht erlaubt -- »%c«

source: %s: invalid option -- %c
de: %s: Ungültige Option -- »%c«

source: %s: option requires an argument -- %c
de: %s: Diese Option benötigt ein Argument -- »%c«

source: %s: option `-W %s' is ambiguous
de: %s: Die Option »-W %s« ist nicht eindeutig

source: %s: option `-W %s' doesn't allow an argument
de: %s: Die Option »-W %s« erlaubt kein Argument

source: Warning: using insecure memory!
de: Warnung: Sensible Daten könnten auf Platte ausgelagert werden.

source: operation is not possible without initialized secure memory
de: Vorgang ist ohne sicheren Hauptspeicher nicht möglich

source: (you may have used the wrong program for this task)
de: (möglicherweise haben Sie das falsche Programm für diese Aufgabe benutzt)

source: Usage: secret-query [OPTION]... [QUESTION] Ask securely for a secret and print it to stdout. Put QUESTION in the window, if given. -e, --enhanced ask for timeout and insurance, too -g, --no-global-grab grab keyboard only while window is focused -d, --debug turn on debugging output --help display this help and exit --version output version information and exit
de: Benutzung: secret-query [OPTION]... [FRAGE] Frage auf sichere Art nach einem Geheimnis und schreibe es auf stdout. Falls angegeben, benutze FRAGE im Dialogfenster. -e, --enhanced frage auch nach Lebensdauer und Nachfrageoption -g, --no-global-grab Exklusivzugriff auf die Tastatur nur solange das Fenster fokussiert ist -d, --debug schalte englische deubgging-Meldungen ein --help zeige diese Hilfe an und beende --version gib Versionsinformationen aus und beende

source: could not grab keyboard
de: konnte Tastatur nicht exklusiv abgreifen

source: Please give me your secret:
de: Bitte Geheimnis eingeben:

source: ask before giving out secret
de: Nachfragen vor dem Aushändigen des Geheimnisses

source: Cancel
de: Abbrechen

source: lowering privileges failed
de: Aussetzen von Privilegien schlug fehl

source: Warning: running q-agent setuid on this system is dangerous
de: Warnung: q-agent auf diesem System mit setuid auszustatten ist gefährlich

source: Warning: raising privileges failed
de: Warnung: Wiedererlangung von Privilegien schlug fehl

source: dropping privileges failed
de: Privilegienabbau schlug fehl
